#+LATEX_HEADER: \usepackage{pgfgantt}
#+LATEX_HEADER: \usepackage{lscape}
#+LATEX_HEADER: \usepackage{graphicx}

* Something
** Else
   DEADLINE: <2015-06-22 Mo> SCHEDULED: <2015-05-29 Fr>
   :PROPERTIES:
   :CUSTOM_ID: Else123
   :END:
** don't bother [32%]
* Ordered-Test :test:
   DEADLINE: <2015-05-26 Di>
  :PROPERTIES:
  :ORDERED:  t
  :ID: ordered123
  :END:      
** Order1
   CLOCK: [2015-05-20 Mi 11:06]--[2015-05-20 Mi 11:06] =>  0:00
   CLOCK: [2015-05-19 Di 17:00]--[2015-05-20 Mi 01:30] =>  8:30
   CLOCK: [2015-05-19 Di 17:40]--[2015-05-20 Mi 01:10] =>  7:30
   :PROPERTIES:
   :Effort:   1d
   :END:
** Order2
   CLOCK: [2015-05-27 Mi 13:35]--[2015-05-27 Mi 21:35] =>  8:00
   :PROPERTIES:
   :Effort:   2d
   :END:
** Millstone 							   :milestone:
* Ordered-Test2 :toast:
  :PROPERTIES:
  :ORDERED:  t
  :ID: ordered123
  :END:      
** Order3
   SCHEDULED: <2015-05-21 Do>
   :PROPERTIES:
   :Effort:   1d
   :END:
** Order4 :l2tag:
*** SO 1
   :PROPERTIES:
   :Effort:   3:00
   :END:
*** SO 2
   :PROPERTIES:
   :Effort:   5:00
   :END:
*** SO 3
   :PROPERTIES:
   :Effort:   3:00
   :END:

* Direct Schedule Test
  DEADLINE: <2015-06-04 Do> SCHEDULED: <2014-05-15 Do>

#+BEGIN_landscape
#+BEGIN: org-gantt-chart :tikz-options "scale=0.5, every node/.style={scale=0.5}" :compress t :weekend-style "{draw=blue!10, line width=1pt}" :workday-style "{draw=blue!5, line width=.75pt}" :progress if-clocksum :no-date-headlines inactive :parameters "y unit title=.7cm, y unit chart=.9cm" :tags-group-style (("test"."group label font=\\color{blue}")("toast"."group label font=\\color{green}")) :tags-bar-style (("test"."bar label font=\\color{blue}")("toast"."bar label font=\\color{green}"))
\begin{tikzpicture}[scale=0.5, every node/.style={scale=0.5}]
\begin{ganttchart}[time slot format=isodate, vgrid={*1{draw=blue!5, line width=.75pt},*3{draw=blue!10, line width=1pt},*3{draw=blue!5, line width=.75pt}}, compress calendar, y unit title=.7cm, y unit chart=.9cm]{2014-05-15}{2015-06-22}
\gantttitlecalendar{year, month}\\
\ganttgroup[group left shift=0.9354838709677419, group right shift=-0.2666666666666667]{Something}{2015-05-29}{2015-06-22}\\
  \ganttbar[bar left shift=0.9354838709677419, bar right shift=-0.2666666666666667]{Else}{2015-05-29}{2015-06-22}\\
  \ganttbar[bar left shift=0.4838709677419355, bar right shift=-0.5161290322580645]{don't bother [32]}{2014-05-15}{2014-05-15}\\
\ganttgroup[group left shift=0.7096774193548387, group right shift=-0.16129032258064513, group label font=\color{blue}]{Ordered-Test}{2015-05-22}{2015-05-26}\\
  \ganttbar[bar left shift=0.7096774193548387, bar right shift=-0.29032258064516125, bar label font=\color{blue}]{Order1}{2015-05-22}{2015-05-22}\\
  \ganttlinkedbar[bar left shift=0.8064516129032258, bar right shift=-0.16129032258064513, bar label font=\color{blue}]{Order2}{2015-05-25}{2015-05-26}\\
  \ganttlinkedmilestone[bar left shift=0.8709677419354839, bar right shift=-0.16129032258064513, bar label font=\color{blue}]{Millstone}{2015-05-26}\\
\ganttgroup[group left shift=0.6774193548387096, group right shift=-0.19354838709677424, group label font=\color{green}]{Ordered-Test2}{2015-05-21}{2015-05-25}\\
  \ganttbar[bar left shift=0.6774193548387096, bar right shift=-0.32258064516129037, bar label font=\color{green}]{Order3}{2015-05-21}{2015-05-21}\\
  \ganttlinkedgroup[group left shift=0.7096774193548387, group right shift=-0.19354838709677424, group label font=\color{green}]{Order4}{2015-05-22}{2015-05-25}\\
    \ganttbar[bar left shift=0.7096774193548387, bar right shift=-0.29032258064516125, bar label font=\color{green}]{SO 1}{2015-05-22}{2015-05-22}\\
    \ganttlinkedbar[bar left shift=0.7096774193548387, bar right shift=-0.29032258064516125, bar label font=\color{green}]{SO 2}{2015-05-22}{2015-05-22}\\
    \ganttlinkedbar[bar left shift=0.8064516129032258, bar right shift=-0.19354838709677424, bar label font=\color{green}]{SO 3}{2015-05-25}{2015-05-25}\\
\ganttbar[bar left shift=0.4838709677419355, bar right shift=-0.8666666666666667]{Direct Schedule Test}{2014-05-15}{2015-06-04}\\
\end{ganttchart}
\end{tikzpicture}
#+END:
#+END_landscape
